src/DataProcessors/stdl_ReadStudentPerformanceByStudentIdByPeriod/stdl_ReadStudentPerformanceByStudentIdByPeriod.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>stdl_ReadStudentPerformanceByStudentIdByPeriod</name>
</mdclass:DataProcessor>

src/Documents/Занятие/Занятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="48847f19-7b9f-4b13-a136-681b25f994b8">
  <name>Занятие</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="dd77ce36-5028-44f6-a88a-000d6cd21d68">
    <name>Дисциплина</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd98a9cb-580f-4b79-87a7-60f48304de1c">
    <name>ВидНагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07db530f-c91a-475c-9490-f074729b7d3c">
    <name>ВидКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="5be130e3-4549-4767-9691-891d96c3820d">
    <name>Студенты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7d0f091e-0882-4488-b39e-38e35727ebb6">
      <name>Студент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c3971ee4-99ac-4268-85c7-e6268d1fb6a1">
      <name>Оценка1</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="65f9eef8-ea27-4b1b-8b17-79ba756a0810">
      <name>Зачет1</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="77d21124-6c9e-4166-bfad-bac8dfe043a0">
      <name>Явка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="74f6e879-a687-4fbc-9486-035e4ab8b0d1">
      <name>Оценка2</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3685e162-4396-4070-be51-769ed3009df7">
      <name>Оценка3</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="de720eff-7b4b-4b31-820a-10e2b0b7f52b">
      <name>Оценка4</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="211c1b6b-bbc6-4543-8253-2ff6dae0bcf1">
      <name>Оценка5</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="85cfd03d-9c80-4604-8215-a610d6ac4bd6">
      <name>Зачет2</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="02ce29ed-0481-4198-a868-a9a6f01f34cc">
      <name>Зачет3</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6dd9dc2f-663e-4da5-be5f-8ad2fc174e0f">
      <name>Зачет4</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2d792d7d-8881-4bac-bcac-64e3e5d83a11">
      <name>Зачет5</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cc83bdda-f2f0-4754-b8ab-4ef25d3c5b3d">
      <name>ВидКонтроля1</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="91bb6379-fe4e-4c72-852c-9ca58a7ce844">
      <name>ВидКонтроля2</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3370c674-f649-4ecd-8056-18b2e7acac10">
      <name>ВидКонтроля3</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7327976b-cbb4-4340-95d7-f000a5683c34">
      <name>ВидКонтроля4</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="feb71bfb-b366-49eb-9140-1cc32f58cae3">
      <name>ВидКонтроля5</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d5769adb-d538-40a8-b9c5-f289a8f1205e">
      <name>Опоздание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Ведомость/Ведомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4f8bb741-7a20-43c5-9c33-1be9330328a2">
  <name>Ведомость</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="86e22072-842f-4969-b8a7-3dd8fb1d26c5">
    <name>Дисциплина</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55d78621-a867-4626-a6f0-3f1379f9b2d7">
    <name>ВидНагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ab3982a-3b5e-4a4c-923c-663c1e305261">
    <name>ВидКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="5ce43845-6ebd-4939-9f67-f602f4b5cd0b">
    <name>Студенты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="00509ca7-554c-4031-968f-5b0dfa5327b7">
      <name>Студент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6f781851-cb04-4581-a0e3-480123c2e3e7">
      <name>Оценка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="96ad7fb2-3a07-4d11-81e8-1f5d712a2454">
      <name>Зачет</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d51d81c2-2a03-4d41-b220-12d780e15ae4">
      <name>Явка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/НаправлениеНаПересдачу/НаправлениеНаПересдачу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c7fd3290-134c-4176-9847-8b2e7bdd98ed">
  <name>НаправлениеНаПересдачу</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3a1bb7c1-6734-448d-9311-264f4f9c82c5">
    <name>Дисциплина</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="438355f9-3035-426e-afa2-98c3508e3f2b">
    <name>ВидНагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b78b6ff9-fd42-4b1f-b70b-b1c8887e262e">
    <name>ВидКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f029dc34-871f-4192-accf-0ac327845336">
    <name>Студент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b64c3ee9-644d-4652-b34c-156a6d6e936a">
    <name>Оценка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9be9fbb3-116b-4003-b3ad-03a67a23666d">
    <name>Зачет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

src/Documents/ПротоколГАК/ПротоколГАК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8d39cc1c-db21-462f-992c-86e33d3ba7eb">
  <name>ПротоколГАК</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9371f9db-6764-4f88-8f10-56392d9414b6">
    <name>Дисциплина</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01eb1725-ea23-46c8-ac8a-9548854ac8de">
    <name>ВидКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f0255557-12b0-450b-adfa-2f4444d1d8ed">
    <name>Результаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c229214e-e9ea-480b-8c7a-114ce6caeb71">
      <name>Студент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f7ef830d-f9b2-4101-bc5c-8aa5066ab467">
      <name>Оценка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>1</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d3341101-f2f9-4e34-ab42-fcf179405ad0">
      <name>Неявка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ОтчетПоПрактике/ОтчетПоПрактике.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5eeb7e50-d7ff-4f71-b386-b95ae64bf6df">
  <name>ОтчетПоПрактике</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="69d41467-e7c3-4e97-bf50-f018e6c2ed85">
    <name>ВидПрактики</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9264072-10f5-4580-ae42-ac736cdac630">
    <name>ВидКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="e5846efe-5712-477e-9db5-5ea17de77844">
    <name>РезультатыПрактики</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="96395f09-bd9d-4bdf-a56a-ec563d52a462">
      <name>Студент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be4360ea-5d42-4bb9-8153-61393b7675fd">
      <name>Оценка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e16c9989-158b-437f-8dfc-f78f014a2069">
      <name>Зачет</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ДополнительноеЗанятие/ДополнительноеЗанятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3f2226f7-5cfa-465d-9db0-52157ec4d014">
  <name>ДополнительноеЗанятие</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="8052169d-c75c-4857-a879-2e0446c141df">
    <name>Дисциплина</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ecbcb0dc-1cad-47d1-b622-1e7c8e5487d2">
    <name>Студенты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="acb6ffe7-b75f-4a79-8b8f-3fdece3958f8">
      <name>Студент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5b1addc6-97ee-4a15-9c0d-621a3216bd74">
      <name>Явка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8fd3ad20-0a23-4b17-a880-79dc3dfe556b">
      <name>Оценка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/stdl_ReadStudentPerformanceByStudentIdByPeriod/ObjectModule.bsl
// @strict-types
#Если Сервер Тогда

#Область ПрограммныйИнтерфейс

// Обработчик.
// 
// Параметры:
//	Контекст - Структура
// 
// Возвращаемое значение:
//	HTTPСервисОтвет
Функция Обработчик(Контекст) Экспорт
	Параметры = Параметры(оас_Контекст.Параметры(Контекст));

	Студент = stdl_Студенты.Получить(Новый УникальныйИдентификатор(Параметры.id));

	Если Студент = Неопределено Тогда
		ТелоОтвета = stdl_Ошибки.ReferenceNotFound("Student with provided ID was not found.", "student");
		Возврат Ответ_400_application_json(ТелоОтвета);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗанятиеСтуденты.Ссылка.Дата КАК date,
	|	ЗанятиеСтуденты.Ссылка.Дисциплина КАК discipline,
	|	ЗанятиеСтуденты.Ссылка.ВидНагрузки КАК workType,
	|	ЗанятиеСтуденты.Ссылка.ВидКонтроля КАК controlType,
	|	ЗанятиеСтуденты.Оценка1 КАК mark1,
	|	ЗанятиеСтуденты.Зачет1 КАК isPassed1,
	|	ЗанятиеСтуденты.ВидКонтроля1 КАК controlType1,
	|	ЗанятиеСтуденты.Оценка2 КАК mark2,
	|	ЗанятиеСтуденты.Зачет2 КАК isPassed2,
	|	ЗанятиеСтуденты.ВидКонтроля2 КАК controlType2,
	|	ЗанятиеСтуденты.Оценка3 КАК mark3,
	|	ЗанятиеСтуденты.Зачет3 КАК isPassed3,
	|	ЗанятиеСтуденты.ВидКонтроля3 КАК controlType3,
	|	ЗанятиеСтуденты.Оценка4 КАК mark4,
	|	ЗанятиеСтуденты.Зачет4 КАК isPassed4,
	|	ЗанятиеСтуденты.ВидКонтроля4 КАК controlType4,
	|	ЗанятиеСтуденты.Оценка5 КАК mark5,
	|	ЗанятиеСтуденты.Зачет5 КАК isPassed5,
	|	ЗанятиеСтуденты.ВидКонтроля5 КАК controlType5,
	|	ЗанятиеСтуденты.Опоздание КАК isLate,
	|	ЗанятиеСтуденты.Явка КАК isAttended,
	|	ЗанятиеСтуденты.Ссылка КАК document
	|ИЗ
	|	Документ.Занятие.Студенты КАК ЗанятиеСтуденты
	|ГДЕ
	|	ЗанятиеСтуденты.Студент = &Студент
	|	И ЗанятиеСтуденты.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗанятиеСтуденты.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ЗанятиеСтуденты.Ссылка.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВедомостьСтуденты.Ссылка.Дата КАК date,
	|	ВедомостьСтуденты.Ссылка.Дисциплина КАК discipline,
	|	ВедомостьСтуденты.Ссылка.ВидНагрузки КАК workType,
	|	ВедомостьСтуденты.Ссылка.ВидКонтроля КАК controlType,
	|	ВедомостьСтуденты.Оценка КАК mark1,
	|	ВедомостьСтуденты.Зачет КАК isPassed1,
	|	ВедомостьСтуденты.Ссылка.ВидКонтроля КАК controlType1,
	|	NULL КАК mark2,
	|	NULL КАК isPassed2,
	|	NULL КАК controlType2,
	|	NULL КАК mark3,
	|	NULL КАК isPassed3,
	|	NULL КАК controlType3,
	|	NULL КАК mark4,
	|	NULL КАК isPassed4,
	|	NULL КАК controlType4,
	|	NULL КАК mark5,
	|	NULL КАК isPassed5,
	|	NULL КАК controlType5,
	|	NULL КАК isLate,
	|	ВедомостьСтуденты.Явка КАК isAttended,
	|	ВедомостьСтуденты.Ссылка КАК document
	|ИЗ
	|	Документ.Ведомость.Студенты КАК ВедомостьСтуденты
	|ГДЕ
	|	ВедомостьСтуденты.Студент = &Студент
	|	И ВедомостьСтуденты.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВедомостьСтуденты.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ВедомостьСтуденты.Ссылка.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаправлениеНаПересдачу.Дата КАК date,
	|	НаправлениеНаПересдачу.Дисциплина КАК discipline,
	|	НаправлениеНаПересдачу.ВидНагрузки КАК workType,
	|	НаправлениеНаПересдачу.ВидКонтроля КАК controlType,
	|	НаправлениеНаПересдачу.Оценка КАК mark1,
	|	НаправлениеНаПересдачу.Зачет КАК isPassed1,
	|	НаправлениеНаПересдачу.ВидКонтроля КАК controlType1,
	|	NULL КАК mark2,
	|	NULL КАК isPassed2,
	|	NULL КАК controlType2,
	|	NULL КАК mark3,
	|	NULL КАК isPassed3,
	|	NULL КАК controlType3,
	|	NULL КАК mark4,
	|	NULL КАК isPassed4,
	|	NULL КАК controlType4,
	|	NULL КАК mark5,
	|	NULL КАК isPassed5,
	|	NULL КАК controlType5,
	|	NULL КАК isLate,
	|	NULL КАК isAttended,
	|	НаправлениеНаПересдачу.Ссылка КАК document
	|ИЗ
	|	Документ.НаправлениеНаПересдачу КАК НаправлениеНаПересдачу
	|ГДЕ
	|	НаправлениеНаПересдачу.Студент = &Студент
	|	И НаправлениеНаПересдачу.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НаправлениеНаПересдачу.ПометкаУдаления = ЛОЖЬ
	|	И НаправлениеНаПересдачу.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПротоколГАКРезультаты.Ссылка.Дата КАК date,
	|	ПротоколГАКРезультаты.Ссылка.Дисциплина КАК discipline,
	|	NULL КАК workType,
	|	ПротоколГАКРезультаты.Ссылка.ВидКонтроля КАК controlType,
	|	ПротоколГАКРезультаты.Оценка КАК mark1,
	|	NULL КАК isPassed1,
	|	ПротоколГАКРезультаты.Ссылка.ВидКонтроля КАК controlType1,
	|	NULL КАК mark2,
	|	NULL КАК isPassed2,
	|	NULL КАК controlType2,
	|	NULL КАК mark3,
	|	NULL КАК isPassed3,
	|	NULL КАК controlType3,
	|	NULL КАК mark4,
	|	NULL КАК isPassed4,
	|	NULL КАК controlType4,
	|	NULL КАК mark5,
	|	NULL КАК isPassed5,
	|	NULL КАК controlType5,
	|	NULL КАК isLate,
	|	ВЫБОР
	|		КОГДА ПротоколГАКРезультаты.Неявка ЕСТЬ NULL
	|			ТОГДА NULL
	|		ИНАЧЕ
	|		НЕ ПротоколГАКРезультаты.Неявка
	|	КОНЕЦ КАК isAttended,
	|	ПротоколГАКРезультаты.Ссылка КАК document
	|ИЗ
	|	Документ.ПротоколГАК.Результаты КАК ПротоколГАКРезультаты
	|ГДЕ
	|	ПротоколГАКРезультаты.Студент = &Студент
	|	И ПротоколГАКРезультаты.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПротоколГАКРезультаты.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ПротоколГАКРезультаты.Ссылка.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетПоПрактикеРезультатыПрактики.Ссылка.Дата КАК date,
	|	ОтчетПоПрактикеРезультатыПрактики.Ссылка.ВидПрактики КАК discipline,
	|	NULL КАК workType,
	|	ОтчетПоПрактикеРезультатыПрактики.Ссылка.ВидКонтроля КАК controlType,
	|	ОтчетПоПрактикеРезультатыПрактики.Оценка КАК mark1,
	|	ОтчетПоПрактикеРезультатыПрактики.Зачет КАК isPassed1,
	|	ОтчетПоПрактикеРезультатыПрактики.Ссылка.ВидКонтроля КАК controlType1,
	|	NULL КАК mark2,
	|	NULL КАК isPassed2,
	|	NULL КАК controlType2,
	|	NULL КАК mark3,
	|	NULL КАК isPassed3,
	|	NULL КАК controlType3,
	|	NULL КАК mark4,
	|	NULL КАК isPassed4,
	|	NULL КАК controlType4,
	|	NULL КАК mark5,
	|	NULL КАК isPassed5,
	|	NULL КАК controlType5,
	|	NULL КАК isLate,
	|	NULL КАК isAttended,
	|	ОтчетПоПрактикеРезультатыПрактики.Ссылка КАК document
	|ИЗ
	|	Документ.ОтчетПоПрактике.РезультатыПрактики КАК ОтчетПоПрактикеРезультатыПрактики
	|ГДЕ
	|	ОтчетПоПрактикеРезультатыПрактики.Студент = &Студент
	|	И ОтчетПоПрактикеРезультатыПрактики.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОтчетПоПрактикеРезультатыПрактики.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ОтчетПоПрактикеРезультатыПрактики.Ссылка.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительноеЗанятиеСтуденты.Ссылка.Дата КАК date,
	|	ДополнительноеЗанятиеСтуденты.Ссылка.Дисциплина КАК discipline,
	|	NULL КАК workType,
	|	NULL КАК controlType,
	|	ДополнительноеЗанятиеСтуденты.Оценка КАК mark1,
	|	NULL КАК isPassed1,
	|	NULL КАК controlType1,
	|	NULL КАК mark2,
	|	NULL КАК isPassed2,
	|	NULL КАК controlType2,
	|	NULL КАК mark3,
	|	NULL КАК isPassed3,
	|	NULL КАК controlType3,
	|	NULL КАК mark4,
	|	NULL КАК isPassed4,
	|	NULL КАК controlType4,
	|	NULL КАК mark5,
	|	NULL КАК isPassed5,
	|	NULL КАК controlType5,
	|	NULL КАК isLate,
	|	ДополнительноеЗанятиеСтуденты.Явка КАК isAttended,
	|	ДополнительноеЗанятиеСтуденты.Ссылка КАК document
	|ИЗ
	|	Документ.ДополнительноеЗанятие.Студенты КАК ДополнительноеЗанятиеСтуденты
	|ГДЕ
	|	ДополнительноеЗанятиеСтуденты.Студент = &Студент
	|	И ДополнительноеЗанятиеСтуденты.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДополнительноеЗанятиеСтуденты.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ДополнительноеЗанятиеСтуденты.Ссылка.Проведен = ИСТИНА";

	Запрос.УстановитьПараметр("Студент", Студент);
	Запрос.УстановитьПараметр("НачалоПериода", ПрочитатьДатуJSON(Параметры.periodStart, ФорматДатыJSON.ISO));
	Запрос.УстановитьПараметр("КонецПериода", ПрочитатьДатуJSON(Параметры.periodEnd, ФорматДатыJSON.ISO));

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	ДокументКНаименованию = Новый Соответствие;
	ДокументКНаименованию.Вставить(Тип("ДокументСсылка.Ведомость"), "statement");
	ДокументКНаименованию.Вставить(Тип("ДокументСсылка.НаправлениеНаПересдачу"), "retakeReferral");
	ДокументКНаименованию.Вставить(Тип("ДокументСсылка.ПротоколГАК"), "stateCertificationBoardProtocol");
	ДокументКНаименованию.Вставить(Тип("ДокументСсылка.ОтчетПоПрактике"), "practiceReport");
	ДокументКНаименованию.Вставить(Тип("ДокументСсылка.АкадемическаяСправкаВходящая"), "incomingAcademicCertificate");
	ДокументКНаименованию.Вставить(Тип("ДокументСсылка.ДополнительноеЗанятие"), "additionalClass");
	ДокументКНаименованию.Вставить(Тип("ДокументСсылка.Занятие"), "class");

	ДисциплинаКНаименованию = stdl_СоответствияНаименований.ДисциплинаКНаименованию();

	ТелоОтвета = Новый Массив; // Массив из Структура

	Пока Выборка.Следующий() Цикл
		Entry = Новый Структура;
		
		//@skip-check property-return-type
		Если НЕ ЗначениеЗаполнено(Выборка.discipline) Тогда
			Продолжить;
		Иначе
			Discipline = Новый Структура;
			//@skip-check property-return-type
			Discipline.Вставить("objectType", stdl_Утилиты.ИсключитьНеопределено(ДисциплинаКНаименованию.Получить(
				ТипЗнч(Выборка.discipline)), "Неизвестный тип дисциплины"));
			//@skip-check dynamic-access-method-not-found
			Discipline.Вставить("objectId", Выборка.discipline.УникальныйИдентификатор());
		КонецЕсли;

		Marks = Новый Массив; // Массив из Структура
		Для НомерОценки = 1 По 5 Цикл
			Оценка = СоставитьОценку(Выборка, НомерОценки);
			Если Оценка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Marks.Добавить(Оценка);
		КонецЦикла;

		//@skip-check property-return-type
		Entry.Вставить("objectType", stdl_Утилиты.ИсключитьНеопределено(ДокументКНаименованию.Получить(ТипЗнч(
			Выборка.document)), "Неизвестный тип документа"));
		//@skip-check dynamic-access-method-not-found
		//@skip-check property-return-type
		Entry.Вставить("objectId", Выборка.document.УникальныйИдентификатор());
		//@skip-check property-return-type
		Entry.Вставить("date", Выборка.date);
		Entry.Вставить("discipline", Discipline);
		//@skip-check property-return-type
		Entry.Вставить("workTypeId", stdl_Утилиты.ПолучитьУИДСсылки(Выборка.workType));
		//@skip-check property-return-type
		Entry.Вставить("controlTypeId", stdl_Утилиты.ПолучитьУИДСсылки(Выборка.controlType));
		//@skip-check property-return-type
		Entry.Вставить("isLate", Выборка.isLate);
		//@skip-check property-return-type
		Entry.Вставить("isAttended", Выборка.isAttended);
		Entry.Вставить("marks", Marks);
		
		ТелоОтвета.Добавить(Entry);
	КонецЦикла;

	Возврат Ответ_200_application_json(ТелоОтвета);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Составить оценку.
// 
// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса
//  НомерОценки - Число
// 
// Возвращаемое значение:
// 	- Неопределено
//  - см. _Ответ_200_application_json_Определения.Ответ_Элемент_marks_Элемент_1
//	- см. _Ответ_200_application_json_Определения.Ответ_Элемент_marks_Элемент_2
Функция СоставитьОценку(Выборка, НомерОценки)
	Если НЕ ЗначениеЗаполнено(Выборка["controlType" + НомерОценки]) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ВидКонтроля = Выборка["controlType" + НомерОценки]; // см. СправочникСсылка.ВидыКонтроля

	//@skip-check reading-attribute-from-database
	ТипОценки = ВидКонтроля.ТипОценки;
	//@skip-check reading-attribute-from-database
	Если НЕ ЗначениеЗаполнено(ТипОценки) ИЛИ ТипОценки.ЦифроваяШкала = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	//@skip-check reading-attribute-from-database
	Если ТипОценки.ЦифроваяШкала Тогда
		Если Выборка["mark" + НомерОценки] = Неопределено Или ТипОценки.НеудовлетворительноНижнийПредел = Неопределено Или Выборка["mark" + НомерОценки]
			< ТипОценки.НеудовлетворительноНижнийПредел Тогда
			Возврат Неопределено;
		КонецЕсли;
		Mark = Выборка["mark" + НомерОценки]; // Число
		Оценка = Новый Структура;
		Оценка.Вставить("number", НомерОценки);
		Оценка.Вставить("mark", Mark);
		Оценка.Вставить("controlTypeId", Строка(ВидКонтроля.УникальныйИдентификатор()));
		Возврат Оценка;
	Иначе
		Если Выборка["isPassed" + НомерОценки] = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		IsPassed = Выборка["isPassed" + НомерОценки]; // Булево
		Оценка = Новый Структура;
		Оценка.Вставить("number", НомерОценки);
		Оценка.Вставить("isPassed", IsPassed);
		Оценка.Вставить("controlTypeId", Строка(ВидКонтроля.УникальныйИдентификатор()));
		//@skip-check constructor-function-return-section
		Возврат Оценка;
	КонецЕсли;
КонецФункции

// Параметры:
//	Параметры - Соответствие из КлючИЗначение -:
//		*Ключ - Произвольный
//		*Значение - Произвольный
// Возвращаемое значение:
//	Структура:
//		*id - Строка -
//		*periodEnd - Строка -
//		*periodStart - Строка -
Функция Параметры(Параметры)
	Результат = оас_Утилиты_КлиентСервер.ПолучитьСтруктуруИзСоответствия(Параметры);
	//@skip-check constructor-function-return-section
	Возврат Результат;
КонецФункции

#Область Ответы

// Параметры:
//	Тело - Массив из см. _Ответ_200_application_json_Определения.Ответ_Элемент -
//
// Возвращаемое значение:
//	HTTPСервисОтвет
Функция Ответ_200_application_json(Тело)
	КодОтвета = 200;
	Ответ = Новый HTTPСервисОтвет(КодОтвета);

	ТелоСтрокой = stdl_JSONКлиентСервер.Записать(Тело);
	Ответ.УстановитьТелоИзСтроки(ТелоСтрокой);

	Возврат Ответ;
КонецФункции
// Параметры:
//	Тело - см. _Ответ_400_application_json_Определения.Ответ
//
// Возвращаемое значение:
//	HTTPСервисОтвет
Функция Ответ_400_application_json(Тело)
	КодОтвета = 400;
	Ответ = Новый HTTPСервисОтвет(КодОтвета);

	ТелоСтрокой = stdl_JSONКлиентСервер.Записать(Тело);
	Ответ.УстановитьТелоИзСтроки(ТелоСтрокой);

	Возврат Ответ;
КонецФункции
#КонецОбласти

#Область Определения

//@skip-check module-unused-method
// Возвращаемое значение:
//	Неопределено
Функция _Параметры_Определения()
	оас_Утилиты_КлиентСервер.ОшибкаТолькоДляОпределения();
	Возврат Неопределено;
КонецФункции

//@skip-check module-unused-method
// Параметры:
//	Ответ_Элемент - Структура -:
//		*objectType - Строка - "statement" | "retakeReferral" | "stateCertificationBoardProtocol" | "practiceReport" | "incomingAcademicCertificate" | "additionalClass" | "class" | 
//		*objectId - Строка -
//		*date - Строка -
//		*workTypeId - Неопределено, Строка -
//		*isAttended - Неопределено, Булево -
//		*discipline - см. _Ответ_200_application_json_Определения.Ответ_Элемент_discipline
//		*controlTypeId - Неопределено, Строка -
//		*marks - Массив из см. _Ответ_200_application_json_Определения.Ответ_Элемент_marks_Элемент_1, см. _Ответ_200_application_json_Определения.Ответ_Элемент_marks_Элемент_2 - -
//		*isLate - Неопределено, Булево -
//	Ответ_Элемент_marks_Элемент_2 - Структура:
//		*number - Число -
//		*isPassed - Булево -
//		*controlTypeId - Строка -
//	Ответ_Элемент_marks_Элемент_1 - Структура:
//		*number - Число -
//		*mark - Число -
//		*controlTypeId - Строка -
//	Ответ_Элемент_discipline - Структура -:
//		*objectType - Строка - "discipline" | "practiceKind" | 
//		*objectId - Строка -
// Возвращаемое значение:
//	Неопределено
Функция _Ответ_200_application_json_Определения(Ответ_Элемент, Ответ_Элемент_marks_Элемент_2, Ответ_Элемент_marks_Элемент_1, Ответ_Элемент_discipline)
	оас_Утилиты_КлиентСервер.ОшибкаТолькоДляОпределения();
	Возврат Неопределено;
КонецФункции
//@skip-check module-unused-method
// Параметры:
//	Ответ - Структура -:
//		*code - Строка - "ReferenceNotFound"
//		*message - Строка -
//		*referenceType - Строка -
// Возвращаемое значение:
//	Неопределено
Функция _Ответ_400_application_json_Определения(Ответ)
	оас_Утилиты_КлиентСервер.ОшибкаТолькоДляОпределения();
	Возврат Неопределено;
КонецФункции
#КонецОбласти

#КонецОбласти

#КонецЕсли
